file_libaio/file_libaio_128_randwrite_4k.log
iscsi_libaio_128_randwrite_4k: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=128
...
fio-3.7
Starting 4 processes

iscsi_libaio_128_randwrite_4k: (groupid=0, jobs=4): err= 0: pid=21123: Fri Mar 12 02:34:48 2021
  write: IOPS=77.0k, BW=305MiB/s (319MB/s)(2000MiB/6568msec)
    slat (nsec): min=1915, max=5156.1M, avg=38479.25, stdev=12090474.43
    clat (nsec): min=1828, max=5400.2M, avg=5013165.66, stdev=144292456.17
     lat (usec): min=3, max=5400.2k, avg=5051.70, stdev=144876.24
    clat percentiles (usec):
     |  1.00th=[    668],  5.00th=[    857], 10.00th=[    881],
     | 20.00th=[    906], 30.00th=[    930], 40.00th=[    955],
     | 50.00th=[    979], 60.00th=[    996], 70.00th=[   1029],
     | 80.00th=[   1057], 90.00th=[   1090], 95.00th=[   1106],
     | 99.00th=[   1205], 99.50th=[   1287], 99.90th=[ 154141],
     | 99.95th=[5335155], 99.99th=[5402264]
   bw (  KiB/s): min=    7, max=548184, per=100.00%, avg=313231.31, stdev=258164.61, samples=13
   iops        : min=    1, max=137046, avg=78307.77, stdev=64541.23, samples=13
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.02%, 500=0.40%, 750=0.67%, 1000=59.21%
  lat (msec)   : 2=39.50%, 4=0.05%, 100=0.02%, 250=0.05%, 750=0.01%
  cpu          : usr=2.44%, sys=17.35%, ctx=1510, majf=0, minf=120
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,512000,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=305MiB/s (319MB/s), 305MiB/s-305MiB/s (319MB/s-319MB/s), io=2000MiB (2097MB), run=6568-6568msec